In [16]:
import pandas as pd

In [17]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items, index=['store1', 'store2'])
store_items

        bikes  pants  watches  glasses
store1     20     30       35      NaN
store2     15      5       10     50.0

In [18]:
store_items[['bikes', 'watches']]

        bikes  watches
store1     20       35
store2     15       10

In [19]:
store_items.loc[['store2']]

        bikes  pants  watches  glasses
store2     15      5       10     50.0

In [20]:
store_items.loc[['store2']][['bikes', 'watches']]

        bikes  watches
store2     15       10

In [21]:
store_items.loc['store2']['bikes']

15.0

In [22]:
store_items['shirt'] = [15, 2]
store_items

        bikes  pants  watches  glasses  shirt
store1     20     30       35      NaN     15
store2     15      5       10     50.0      2

In [23]:
store_items['suits'] = store_items['shirt'] + store_items['pants']
store_items

        bikes  pants  watches  glasses  shirt  suits
store1     20     30       35      NaN     15     45
store2     15      5       10     50.0      2      7

In [24]:
new_store_data = {'bikes': 30, 'pants': 20, 'watches': 5, 'glasses': 2, 'shirt': 8, 'suits': 69}
new_store = pd.DataFrame(new_store_data, index=['store3'])
new_store

        bikes  pants  watches  glasses  shirt  suits
store3     30     20        5        2      8     69

In [28]:
store_items = pd.concat([store_items, new_store])
store_items

        bikes  pants  watches  glasses  shirt  suits
store1     20     30       35      NaN     15     45
store2     15      5       10     50.0      2      7
store3     30     20        5      2.0      8     69

In [29]:
# add new watches to only store 2 and 3
store_items['new_watches'] = store_items['watches'][1:]
store_items

        bikes  pants  watches  glasses  shirt  suits  new_watches
store1     20     30       35      NaN     15     45          NaN
store2     15      5       10     50.0      2      7         10.0
store3     30     20        5      2.0      8     69          5.0

In [30]:
# insert a column shoes at column index 5
store_items.insert(5, 'shoes', [8,5,0])
store_items

        bikes  pants  watches  glasses  shirt  shoes  suits  new_watches
store1     20     30       35      NaN     15      8     45          NaN
store2     15      5       10     50.0      2      5      7         10.0
store3     30     20        5      2.0      8      0     69          5.0

In [31]:
# delete column 'new_watches'
store_items.pop('new_watches')
store_items

        bikes  pants  watches  glasses  shirt  shoes  suits
store1     20     30       35      NaN     15      8     45
store2     15      5       10     50.0      2      5      7
store3     30     20        5      2.0      8      0     69

In [32]:
# delete the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

        bikes  pants  glasses  shirt  suits
store1     20     30      NaN     15     45
store2     15      5     50.0      2      7
store3     30     20      2.0      8     69

In [33]:
# remove rows store1 and store2
store_items = store_items.drop(['store1', 'store2'], axis=0)
store_items

        bikes  pants  glasses  shirt  suits
store3     30     20      2.0      8     69

In [34]:
# rename column bikes to hats
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

        hats  pants  glasses  shirt  suits
store3    30     20      2.0      8     69

In [35]:
# rename row store3 to store0
store_items = store_items.rename(index={'store3': 'store0'})
store_items

        hats  pants  glasses  shirt  suits
store0    30     20      2.0      8     69

In [36]:
# use the pants column as index
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirt  suits
pants
20       30      2.0      8     69